# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite', detect_types = sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute('''
SELECT lastName, firstName FROM employees JOIN offices using(officeCode) WHERE city = 'Boston';
''').fetchall()

[('Firrelli', 'Julie'), ('Patterson', 'Steve')]

## Do any offices have no employees?

In [13]:
cur.execute('''
SELECT * FROM offices LEFT JOIN employees using(officeCode) WHERE employees.officeCode IS NULL; 
''').fetchall()

[]

In [43]:
#Your code here
cur.execute('''
SELECT * FROM offices LEFT JOIN employees USING(officeCode); 
''')

df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.groupby('city').count()

,officeCode,phone,addressLine1,addressLine2,state,country,postalCode,territory,employeeNumber,lastName,firstName,extension,email,reportsTo,jobTitle
city,,,,,,,,,,,,,,,
Boston,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2
London,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2
NYC,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2
Paris,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5
San Francisco,6,6,6,6,6,6,6,6,6,6,6,6,6,6,6
Sydney,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4
Tokyo,2,2,2,2,2,2,2,2,2,2,2,2,2,2,2

In [26]:
cur.execute('''
Select city, COUNT(*) FROM offices LEFT JOIN employees USING(officeCode) GROUP BY 1;
''')

df = pd.DataFrame(cur.fetchall())
df.head()

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [48]:
# Your code here
cur.execute('''
SELECT firstName, lastName, productName
From employees e 
JOIN customers c ON e.employeeNumber = c.salesRepEmployeeNumber
JOIN orders o USING(customerNumber)
JOIN orderdetails od USING(orderNumber)
JOIN products p USING (productCode);
''')

df = pd.DataFrame(cur.fetchall())
df.head()

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [50]:
#Your code here
df.groupby([0,1]).count()

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!